IDEA Open Model
ConcreteMemberDataEc2.DeflectionRequirement Property
Compatible with IDEA StatiCa v 10.1
 gets or set deflection requirement for deflection calculation
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public DeflectionRequirementEc2 DeflectionRequirement { get; set; }
Public Property DeflectionRequirement As DeflectionRequirementEc2
	Get
	Set
public:
property DeflectionRequirementEc2 DeflectionRequirement {
	DeflectionRequirementEc2 get ();
	void set (DeflectionRequirementEc2 value);
}
Property Value
Type: DeflectionRequirementEc2
See Also
Reference
ConcreteMemberDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace